#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
int main() {
    int m[9][9] = {
        {2,2,2,2,2,2,2,2,2},
             {2,0,0,0,0,0,0,0,2},
             {2,0,2,2,0,2,2,0,2},
             {2,0,2,0,0,2,0,0,2},
             {2,0,2,0,2,0,2,0,2},
             {2,0,0,0,0,0,2,0,2},
             {2,2,0,2,2,0,2,2,2},
             {2,0,0,0,0,0,0,0,2},
             {2,2,2,2,2,2,2,2,2}
    };
    int Si, Sj, Ei, Ej;
    int success, top, path_i[100], path_j[100];
    //재귀함수는 시스템 스택
    //S:start,출발점 E:End,도착점, top 경로 배열 인덱스
    //Path_i, Path_j: 지나간 길, 즉 행과 열을 저장함(i는 행, j는 열)
}